### QUICK REVISION NOTES 10

## What is pandas

1. Pandas is a python library that is built on top of numpy. 
2. The name 'pandas' has a reference to both 'panel data' and 'python data analysis'. 
3. It is created in the year of 2008 by Wes McKinney.
4. Pandas is used to analyse big data and make conculsion based on statistical theories.
5. It has functions for analyzing, cleaning, exploring, and manipulating data.

### Importing and using pandas

In [1]:
import pandas as pd     # Importing pandas library
print(pd.__version__)   # To check numpy version
print(len(dir(pd)))     # number of functions available within pandas

1.1.3
140

### Pandas Series

1. Pandas series is a one dimensional labeled array that is capabale of holding data of any types.
2. The axis label of a series is called as index.
3. Simply, series can be defined as column in a table/excel.

In [2]:
# Creating a simple pandas series

name_lst = ['john', 'job', 'sam', 'thomas', 'mike']  # Creating a list of elements
pd_srs= pd.Series(name_lst)                          # Assigning the list to pandas series
pd_srs

# by default the index values starts from 0 and goes till the data exhausts

0      john
1       job
2       sam
3    thomas
4      mike
dtype: object

In [3]:
# assigning index to the pandas series

# While creating:
ipd_srs = pd.Series(name_lst, index=list(range(11,16)))
print('Assigning index while creating pandas series:')
print(ipd_srs)

# After creating
ipd_srs.index = [101,102,103,104,105]
print('\nAssigning / changing index after creating pandas series:')
print(ipd_srs)

Assigning index while creating pandas series:
11      john
12       job
13       sam
14    thomas
15      mike
dtype: object

Assigning / changing index after creating pandas series:
101      john
102       job
103       sam
104    thomas
105      mike
dtype: object

In [4]:
# Creating a Series from an array

import numpy as np
arr = np.arange(1,6)
apd_srs = pd.Series(arr, index = ['a', 'b', 'c', 'd', 'e'])
print(apd_srs)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
# Creating a series from a dictionary

dct = {'john':850000, 'job':750000, 'sam':400000, 'thomas':650000, 'mike':450000}
dpd_srs = pd.Series(dct)
print(dpd_srs)

john      850000
job       750000
sam       400000
thomas    650000
mike      450000
dtype: int64

In [6]:
# Creating Serires by values and index from list

state_lst = ['TN', 'KL', 'AP', 'KA', 'MP', 'RJ']
capital_lst = ['CHN', 'TVM', 'HYD', 'BLR', 'BHO','JAP']
state_capital = pd.Series(capital_lst, index = state_lst)
print(state_capital)

TN    CHN
KL    TVM
AP    HYD
KA    BLR
MP    BHO
RJ    JAP
dtype: object

In [7]:
# Accessing elements of the series

# Indexing and slicing
print(state_capital[3])     # can be accesd by index number
print(state_capital['TN'])  # can be accessed by index name
print(state_capital[1:4])   # accessing a array by slicing

# index and values
print('\nIndex of state_capital:', state_capital.index)
print('Values of state_capital:', state_capital.values)

BLR
CHN
KL    TVM
AP    HYD
KA    BLR
dtype: object

Index of state_capital: Index(['TN', 'KL', 'AP', 'KA', 'MP', 'RJ'], dtype='object')
Values of state_capital: ['CHN' 'TVM' 'HYD' 'BLR' 'BHO' 'JAP']

### Dataframe

1. Pandas dataframe is a two dimensional data structure
2. It is similar to 2-D array or a table with rows and columns

### Creating a dataframe

In [8]:
# Creating a simple dataframe

country = ['India', 'Canada', 'USA', 'Singapore', 'Australia']
s_df = pd.DataFrame(country, columns = ['country_name'], index = list(range(1,6)))
s_df

  country_name
1        India
2       Canada
3          USA
4    Singapore
5    Australia

In [9]:
# creating dataframe from a dictionary

dct = {'emp_id':['001','002','003','004','005','006'], 
       'emp_name':['Tom','bob','jerry','matt','steve','nick'],
       'emp_sal': [800000,500000,600000,650000,560000,1000000]}

dct_df = pd.DataFrame(dct)
dct_df

  emp_id emp_name  emp_sal
0    001      Tom   800000
1    002      bob   500000
2    003    jerry   600000
3    004     matt   650000
4    005    steve   560000
5    006     nick  1000000

In [10]:
# Creating a dataframe from a nested list

nst_lst = [[2002, 'Japan', 'Brazil', 161], 
                [2006, 'Germany', 'Italy', 147], 
                [2010, 'South Africa', 'Spain', 145],
                [2014, 'Brazil', 'Germany', 171]
              ]
lst_df = pd.DataFrame(nst_lst, columns=['Year','Host','Winner','Goals'])
lst_df

   Year          Host   Winner  Goals
0  2002         Japan   Brazil    161
1  2006       Germany    Italy    147
2  2010  South Africa    Spain    145
3  2014        Brazil  Germany    171

### Importing data

1. Most comman file type to save a huge data is CSV and Excel
2. These files can be imported into pandas as dataframes

In [11]:
# importing a CSV file

# syntax - pd.read_csv()
# paste the complete directory with file name and extension as raw string to import from different directory
# use file name with extension if the file present in current location of notebook

csv_df = pd.read_csv('weather_data.csv')
csv_df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [12]:
# importing a excel file

# syntax - pd.read_excel()
# paste the complete directory with file name and extension as raw string to import from different directory
# use file name with extension if the file present in current location of notebook

excel_df = pd.read_excel(r'/home/krishna/Desktop/Git repo/Digital notes/1. Python/football_worldcup.xlsx')
excel_df

   Year       Country    Winner   Runners-Up  GoalsScored  MatchesPlayed
0  1990         Italy  Germany     Argentina          115             52
1  1994           USA    Brazil        Italy          141             52
2  1998        France    France       Brazil          171             64
3  2002         Japan    Brazil      Germany          161             64
4  2006       Germany     Italy       France          147             64
5  2010  South Africa     Spain  Netherlands          145             64
6  2014        Brazil   Germany    Argentina          171             64

### Operations on dataframe

##### To view the shape and size

In [13]:
print('Shape of the dataframe is:',excel_df.shape)
print('Size of the data is:',excel_df.size)         # gives the no.of.elements

Shape of the dataframe is: (7, 6)
Size of the data is: 42

##### To view first 5 data from the dataframe

In [14]:
excel_df.head()

   Year  Country    Winner Runners-Up  GoalsScored  MatchesPlayed
0  1990    Italy  Germany   Argentina          115             52
1  1994      USA    Brazil      Italy          141             52
2  1998   France    France     Brazil          171             64
3  2002    Japan    Brazil    Germany          161             64
4  2006  Germany     Italy     France          147             64

##### To view first 'n' data from the dataframe

In [15]:
excel_df.head(3)

   Year Country    Winner Runners-Up  GoalsScored  MatchesPlayed
0  1990   Italy  Germany   Argentina          115             52
1  1994     USA    Brazil      Italy          141             52
2  1998  France    France     Brazil          171             64

##### To view last 5 data from the dataframe

In [16]:
excel_df.tail()

   Year       Country   Winner   Runners-Up  GoalsScored  MatchesPlayed
2  1998        France   France       Brazil          171             64
3  2002         Japan   Brazil      Germany          161             64
4  2006       Germany    Italy       France          147             64
5  2010  South Africa    Spain  Netherlands          145             64
6  2014        Brazil  Germany    Argentina          171             64

##### To view last 'n' data from the dataframe

In [17]:
excel_df.tail(3)

   Year       Country   Winner   Runners-Up  GoalsScored  MatchesPlayed
4  2006       Germany    Italy       France          147             64
5  2010  South Africa    Spain  Netherlands          145             64
6  2014        Brazil  Germany    Argentina          171             64

##### To view all the column names

In [18]:
print(excel_df.columns)

Index(['Year', 'Country', 'Winner', 'Runners-Up', 'GoalsScored',
       'MatchesPlayed'],
      dtype='object')

##### To view the datapoints of particular column / columns

In [19]:
excel_df['Winner']

0    Germany
1      Brazil
2      France
3      Brazil
4       Italy
5       Spain
6     Germany
Name: Winner, dtype: object

In [20]:
excel_df[['Winner','Year']]

     Winner  Year
0  Germany   1990
1    Brazil  1994
2    France  1998
3    Brazil  2002
4     Italy  2006
5     Spain  2010
6   Germany  2014

##### To view the datapoints of particular column and row (row by index)

In [21]:
excel_df['Winner'][5]

'Spain'

##### Slicing the dataframe

In [22]:
excel_df[3:6]

   Year       Country  Winner   Runners-Up  GoalsScored  MatchesPlayed
3  2002         Japan  Brazil      Germany          161             64
4  2006       Germany   Italy       France          147             64
5  2010  South Africa   Spain  Netherlands          145             64

In [23]:
excel_df[::2]

   Year  Country    Winner Runners-Up  GoalsScored  MatchesPlayed
0  1990    Italy  Germany   Argentina          115             52
2  1998   France    France     Brazil          171             64
4  2006  Germany     Italy     France          147             64
6  2014   Brazil   Germany  Argentina          171             64

### Statistical operations on dataframe

In [24]:
# To view all the statistical details of dataframe

csv_df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

##### To view maximum of a column

In [25]:
csv_df.temperature.max()

35

##### To view min of a column

In [26]:
csv_df.temperature.min()

24

##### To view mean, medain, mode of a column

In [27]:
csv_df.windspeed.mean()

4.666666666666667

In [28]:
csv_df.temperature.median()

31.5

In [29]:
csv_df.temperature.mode()

0    32
dtype: int64

### Adding and deleting data in dataframe

In [30]:
# To ignore all warnings

import warnings
warnings.filterwarnings('ignore')

In [31]:
import pandas as pd

In [32]:
int_org = pd.read_csv('international_org.csv')
int_org

  Organization Name  Headquater
0               FAO        Rome
1               ICJ   The Hague
2               IMF  Washington
3            UNESCO       Paris
4               UNO    New York
5        World Bank  Washington

In [33]:
# adding a new column 'Established_year' and assigning default year

int_org['Established_year'] = 1998
int_org

  Organization Name  Headquater  Established_year
0               FAO        Rome              1998
1               ICJ   The Hague              1998
2               IMF  Washington              1998
3            UNESCO       Paris              1998
4               UNO    New York              1998
5        World Bank  Washington              1998

In [34]:
# Assigning values to all the datapoints of new column

int_org['Established_year'] = 1998,1997,1996,1995,1994,1993
int_org

  Organization Name  Headquater  Established_year
0               FAO        Rome              1998
1               ICJ   The Hague              1997
2               IMF  Washington              1996
3            UNESCO       Paris              1995
4               UNO    New York              1994
5        World Bank  Washington              1993

In [35]:
# changing a particular value by index location

int_org['Established_year'][3] = 2000
int_org

  Organization Name  Headquater  Established_year
0               FAO        Rome              1998
1               ICJ   The Hague              1997
2               IMF  Washington              1996
3            UNESCO       Paris              2000
4               UNO    New York              1994
5        World Bank  Washington              1993

In [36]:
imdb_rat = pd.read_csv('imdb_rating.csv')
imdb_rat

,star_rating,title,genre,duration
0,9.3,The Shawshank Redemption,Crime,142
1,9.2,The Godfather,Crime,175
2,9.1,The Godfather: Part II,Crime,200
3,9.0,The Dark Knight,Action,152
4,8.9,Pulp Fiction,Crime,154
5,8.9,12 Angry Men,Drama,96
6,8.9,"The Good, the Bad and the Ugly",Western,161
7,8.9,The Lord of the Rings: The Return of the King,Adventure,201
8,8.9,Schindler's List,Biography,195
9,8.9,Fight Club,Drama,139

In [37]:
# Deleting a row from a dataframe (ie., axis=0)
imdb_rat.drop(9, axis = 0, inplace = True)  # (inplace = True) will make changes in orginal dataframe

# Deleting a column from a dataframe(ie., axis=1)
imdb_rat.drop('duration', axis = 1, inplace = True)

imdb_rat

   star_rating                                          title      genre
0          9.3                       The Shawshank Redemption      Crime
1          9.2                                  The Godfather      Crime
2          9.1                         The Godfather: Part II      Crime
3          9.0                                The Dark Knight     Action
4          8.9                                   Pulp Fiction      Crime
5          8.9                                   12 Angry Men      Drama
6          8.9                 The Good, the Bad and the Ugly    Western
7          8.9  The Lord of the Rings: The Return of the King  Adventure
8          8.9                               Schindler's List  Biography

In [38]:
# adding a new movie details at the end and re-numbering index to sart from 1

imdb_rat.loc[len(imdb_rat.index)] = [9.4, 'Avengers Infinity War', 'Action'] # adding a row at the end
imdb_rat.index = imdb_rat.index+1   # re-numbering the index
imdb_rat

    star_rating                                          title      genre
1           9.3                       The Shawshank Redemption      Crime
2           9.2                                  The Godfather      Crime
3           9.1                         The Godfather: Part II      Crime
4           9.0                                The Dark Knight     Action
5           8.9                                   Pulp Fiction      Crime
6           8.9                                   12 Angry Men      Drama
7           8.9                 The Good, the Bad and the Ugly    Western
8           8.9  The Lord of the Rings: The Return of the King  Adventure
9           8.9                               Schindler's List  Biography
10          9.4                          Avengers Infinity War     Action

In [39]:
# sorting the dataframe based on star_rating (Ascending order)

imdb_rat.sort_values('star_rating', ascending =True)

    star_rating                                          title      genre
5           8.9                                   Pulp Fiction      Crime
6           8.9                                   12 Angry Men      Drama
7           8.9                 The Good, the Bad and the Ugly    Western
8           8.9  The Lord of the Rings: The Return of the King  Adventure
9           8.9                               Schindler's List  Biography
4           9.0                                The Dark Knight     Action
3           9.1                         The Godfather: Part II      Crime
2           9.2                                  The Godfather      Crime
1           9.3                       The Shawshank Redemption      Crime
10          9.4                          Avengers Infinity War     Action

In [40]:
# sorting the dataframe based on star_rating (Ascending order)

imdb_rat.sort_values('star_rating', ascending =False)

    star_rating                                          title      genre
10          9.4                          Avengers Infinity War     Action
1           9.3                       The Shawshank Redemption      Crime
2           9.2                                  The Godfather      Crime
3           9.1                         The Godfather: Part II      Crime
4           9.0                                The Dark Knight     Action
5           8.9                                   Pulp Fiction      Crime
6           8.9                                   12 Angry Men      Drama
7           8.9                 The Good, the Bad and the Ugly    Western
8           8.9  The Lord of the Rings: The Return of the King  Adventure
9           8.9                               Schindler's List  Biography

In [41]:
# Altering dataframe in way that movie with lowest rating comes first

imdb_rat = imdb_rat.sort_values('star_rating', ascending=True)
imdb_rat

    star_rating                                          title      genre
5           8.9                                   Pulp Fiction      Crime
6           8.9                                   12 Angry Men      Drama
7           8.9                 The Good, the Bad and the Ugly    Western
8           8.9  The Lord of the Rings: The Return of the King  Adventure
9           8.9                               Schindler's List  Biography
4           9.0                                The Dark Knight     Action
3           9.1                         The Godfather: Part II      Crime
2           9.2                                  The Godfather      Crime
1           9.3                       The Shawshank Redemption      Crime
10          9.4                          Avengers Infinity War     Action

In [42]:
# Assigning new index to dataframe

imdb_rat.index = ['movie_1', 'movie_2', 'movie_3', 'movie_4',
                  'movie_5', 'movie_6', 'movie_7', 'movie_8',
                  'movie_9', 'movie_10']
imdb_rat

,star_rating,title,genre
movie_1,8.9,Pulp Fiction,Crime
movie_2,8.9,12 Angry Men,Drama
movie_3,8.9,"The Good, the Bad and the Ugly",Western
movie_4,8.9,The Lord of the Rings: The Return of the King,Adventure
movie_5,8.9,Schindler's List,Biography
movie_6,9.0,The Dark Knight,Action
movie_7,9.1,The Godfather: Part II,Crime
movie_8,9.2,The Godfather,Crime
movie_9,9.3,The Shawshank Redemption,Crime
movie_10,9.4,Avengers Infinity War,Action

In [43]:
# reseting the default index

imdb_rat = imdb_rat.reset_index()
imdb_rat

,index,star_rating,title,genre
0,movie_1,8.9,Pulp Fiction,Crime
1,movie_2,8.9,12 Angry Men,Drama
2,movie_3,8.9,"The Good, the Bad and the Ugly",Western
3,movie_4,8.9,The Lord of the Rings: The Return of the King,Adventure
4,movie_5,8.9,Schindler's List,Biography
5,movie_6,9.0,The Dark Knight,Action
6,movie_7,9.1,The Godfather: Part II,Crime
7,movie_8,9.2,The Godfather,Crime
8,movie_9,9.3,The Shawshank Redemption,Crime
9,movie_10,9.4,Avengers Infinity War,Action

In [44]:
# deleting the newly created index by del attribute

del imdb_rat['index']  # works only to delete column
imdb_rat.index = imdb_rat.index+1
imdb_rat

    star_rating                                          title      genre
1           8.9                                   Pulp Fiction      Crime
2           8.9                                   12 Angry Men      Drama
3           8.9                 The Good, the Bad and the Ugly    Western
4           8.9  The Lord of the Rings: The Return of the King  Adventure
5           8.9                               Schindler's List  Biography
6           9.0                                The Dark Knight     Action
7           9.1                         The Godfather: Part II      Crime
8           9.2                                  The Godfather      Crime
9           9.3                       The Shawshank Redemption      Crime
10          9.4                          Avengers Infinity War     Action

### Indexing and slicing

In [45]:
bike_df = pd.read_csv('citibike_tripdata.csv')
rows, columns = bike_df.shape
print('Number of rows =',rows)
print('Number of columns =',columns)
print(list(bike_df.columns))

Number of rows = 32428
Number of columns = 10
['tripduration', 'starttime', 'stoptime', 'start station id', 'start station name', 'end station id', 'end station name', 'bikeid', 'name_localizedValue', 'usertype']

In [46]:
bike_df

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
0,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
1,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
2,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
3,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
4,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber
...,...,...,...,...,...,...,...,...,...,...
32423,396,2018-05-30 13:49:18,2018-05-30 13:55:55,3184,Paulus Hook,3279,Dixon Mills,29639,Join Citi Bike for $14.95/month,Subscriber
32424,313,2018-05-30 13:49:21,2018-05-30 13:54:35,3202,Newport PATH,3639,Harborside,26301,$25 Off Annual Membership,Subscriber
32425,316,2018-05-30 13:49:51,2018-05-30 13:55:08,3220,5 Corners Library,3195,Sip Ave,29260,Annual Membership,Subscriber
32426,1130,2018-05-30 13:50:52,2018-05-30 14:09:42,3281,Leonard Gordon Park,3213,Van Vorst Park,26239,Annual Membership,Subscriber
32427,369,2018-05-30 13:50:58,2018-05-30 13:57:08,3220,5 Corners Library,3207,Oakland Ave,33660,Annual Membership,Subscriber

In [47]:
# Accessing a data point from the data frame

print(bike_df.at[3, 'tripduration'])
print(bike_df.at[32427, 'end station id'])

190
3207

In [48]:
# creating a new dataframe by slicing the existing dataframe
# changes made in the sliced dataframe will also affect the existing dataframe

nbike_df = bike_df[:10]
nbike_df

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
0,338,2018-05-01 00:04:47,2018-05-01 00:10:25,3639,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
1,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
2,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
3,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
4,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber
5,176,2018-05-01 04:37:05,2018-05-01 04:40:01,3194,McGinley Square,3195,Sip Ave,29298,Annual Membership,Subscriber
6,577,2018-05-01 05:05:46,2018-05-01 05:15:23,3225,Baldwin at Montgomery,3186,Grove St PATH,33619,Annual Membership from Citi Bike App,Subscriber
7,830,2018-05-01 05:11:50,2018-05-01 05:25:41,3207,Oakland Ave,3185,City Hall,33624,Annual Membership,Subscriber
8,395,2018-05-01 05:12:07,2018-05-01 05:18:42,3225,Baldwin at Montgomery,3186,Grove St PATH,26300,Annual Membership,Subscriber
9,170,2018-05-01 05:13:52,2018-05-01 05:16:43,3206,Hilltop,3195,Sip Ave,33555,$25 Off Annual Membership,Subscriber

In [49]:
nbike_df.at[0,'tripduration'] = 340
bike_df.at[0, 'start station id'] = 3199
nbike_df

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
0,340,2018-05-01 00:04:47,2018-05-01 00:10:25,3199,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
1,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
2,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
3,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
4,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber
5,176,2018-05-01 04:37:05,2018-05-01 04:40:01,3194,McGinley Square,3195,Sip Ave,29298,Annual Membership,Subscriber
6,577,2018-05-01 05:05:46,2018-05-01 05:15:23,3225,Baldwin at Montgomery,3186,Grove St PATH,33619,Annual Membership from Citi Bike App,Subscriber
7,830,2018-05-01 05:11:50,2018-05-01 05:25:41,3207,Oakland Ave,3185,City Hall,33624,Annual Membership,Subscriber
8,395,2018-05-01 05:12:07,2018-05-01 05:18:42,3225,Baldwin at Montgomery,3186,Grove St PATH,26300,Annual Membership,Subscriber
9,170,2018-05-01 05:13:52,2018-05-01 05:16:43,3206,Hilltop,3195,Sip Ave,33555,$25 Off Annual Membership,Subscriber

In [50]:
bike_df

# Changes are reflected in both the dataframe

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
0,340,2018-05-01 00:04:47,2018-05-01 00:10:25,3199,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
1,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
2,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
3,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
4,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber
...,...,...,...,...,...,...,...,...,...,...
32423,396,2018-05-30 13:49:18,2018-05-30 13:55:55,3184,Paulus Hook,3279,Dixon Mills,29639,Join Citi Bike for $14.95/month,Subscriber
32424,313,2018-05-30 13:49:21,2018-05-30 13:54:35,3202,Newport PATH,3639,Harborside,26301,$25 Off Annual Membership,Subscriber
32425,316,2018-05-30 13:49:51,2018-05-30 13:55:08,3220,5 Corners Library,3195,Sip Ave,29260,Annual Membership,Subscriber
32426,1130,2018-05-30 13:50:52,2018-05-30 14:09:42,3281,Leonard Gordon Park,3213,Van Vorst Park,26239,Annual Membership,Subscriber
32427,369,2018-05-30 13:50:58,2018-05-30 13:57:08,3220,5 Corners Library,3207,Oakland Ave,33660,Annual Membership,Subscriber

### accessing the datapoints by loc

In [51]:
nbike_df.index = ['row_1', 'row_2', 'row_3', 'row_4', 'row_5', 'row_6', 'row_7', 'row_8', 'row_9', 'row_10']
nbike_df

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
row_1,340,2018-05-01 00:04:47,2018-05-01 00:10:25,3199,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
row_2,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
row_3,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber
row_4,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
row_5,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271,Annual Membership,Subscriber
row_6,176,2018-05-01 04:37:05,2018-05-01 04:40:01,3194,McGinley Square,3195,Sip Ave,29298,Annual Membership,Subscriber
row_7,577,2018-05-01 05:05:46,2018-05-01 05:15:23,3225,Baldwin at Montgomery,3186,Grove St PATH,33619,Annual Membership from Citi Bike App,Subscriber
row_8,830,2018-05-01 05:11:50,2018-05-01 05:25:41,3207,Oakland Ave,3185,City Hall,33624,Annual Membership,Subscriber
row_9,395,2018-05-01 05:12:07,2018-05-01 05:18:42,3225,Baldwin at Montgomery,3186,Grove St PATH,26300,Annual Membership,Subscriber
row_10,170,2018-05-01 05:13:52,2018-05-01 05:16:43,3206,Hilltop,3195,Sip Ave,33555,$25 Off Annual Membership,Subscriber

In [52]:
# Accessing the data of one row at a time

nbike_df.loc['row_5']

tripduration                           303
starttime              2018-05-01 04:27:12
stoptime               2018-05-01 04:32:16
start station id                      3207
start station name             Oakland Ave
end station id                        3195
end station name                   Sip Ave
bikeid                               15271
name_localizedValue      Annual Membership
usertype                        Subscriber
Name: row_5, dtype: object

In [53]:
# Accessing the datapoint of a paticular row

nbike_df.loc['row_5', 'usertype']

'Subscriber'

In [54]:
# slicing required number of rows 

nbike_df.loc['row_2':'row_10':2]

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
row_2,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
row_4,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
row_6,176,2018-05-01 04:37:05,2018-05-01 04:40:01,3194,McGinley Square,3195,Sip Ave,29298,Annual Membership,Subscriber
row_8,830,2018-05-01 05:11:50,2018-05-01 05:25:41,3207,Oakland Ave,3185,City Hall,33624,Annual Membership,Subscriber
row_10,170,2018-05-01 05:13:52,2018-05-01 05:16:43,3206,Hilltop,3195,Sip Ave,33555,$25 Off Annual Membership,Subscriber

In [55]:
# slicing the required rows with required columns

nbike_df.loc['row_1':'row_10':2, ['usertype','starttime','stoptime']]

         usertype            starttime             stoptime
row_1  Subscriber  2018-05-01 00:04:47  2018-05-01 00:10:25
row_3  Subscriber  2018-05-01 01:31:29  2018-05-01 01:35:22
row_5  Subscriber  2018-05-01 04:27:12  2018-05-01 04:32:16
row_7  Subscriber  2018-05-01 05:05:46  2018-05-01 05:15:23
row_9  Subscriber  2018-05-01 05:12:07  2018-05-01 05:18:42

In [56]:
# slicing the required rows with required range of columns

nbike_df.loc['row_1':'row_5', 'start station id':'end station id']

       start station id start station name  end station id
row_1              3199         Harborside            3199
row_2              3681           Grand St            3185
row_3              3194    McGinley Square            3193
row_4              3185          City Hall            3186
row_5              3207        Oakland Ave            3195

In [57]:
# Selecting the required data by conditions

nbike_df.loc[nbike_df['tripduration']>500,['tripduration','name_localizedValue','usertype'] ]

       tripduration                   name_localizedValue    usertype
row_2          1482                               24 Hour    Customer
row_7           577  Annual Membership from Citi Bike App  Subscriber
row_8           830                     Annual Membership  Subscriber

### Accessing data points by iloc

iloc is used for implicit indexing that allows to access datapoints only through the index number

In [58]:
nbike_df.iloc[[0,1,2]]

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
row_1,340,2018-05-01 00:04:47,2018-05-01 00:10:25,3199,Harborside,3199,Newport Pkwy,33558,Annual Membership,Subscriber
row_2,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
row_3,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217,FREE Bonus Month with Annual Membership,Subscriber

In [59]:
nbike_df.iloc[::2,1:8]

,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid
row_1,2018-05-01 00:04:47,2018-05-01 00:10:25,3199,Harborside,3199,Newport Pkwy,33558
row_3,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193,Lincoln Park,29217
row_5,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195,Sip Ave,15271
row_7,2018-05-01 05:05:46,2018-05-01 05:15:23,3225,Baldwin at Montgomery,3186,Grove St PATH,33619
row_9,2018-05-01 05:12:07,2018-05-01 05:18:42,3225,Baldwin at Montgomery,3186,Grove St PATH,26300

In [60]:
nbike_df.iloc[[2,4,6,8],:6]

,tripduration,starttime,stoptime,start station id,start station name,end station id
row_3,232,2018-05-01 01:31:29,2018-05-01 01:35:22,3194,McGinley Square,3193
row_5,303,2018-05-01 04:27:12,2018-05-01 04:32:16,3207,Oakland Ave,3195
row_7,577,2018-05-01 05:05:46,2018-05-01 05:15:23,3225,Baldwin at Montgomery,3186
row_9,395,2018-05-01 05:12:07,2018-05-01 05:18:42,3225,Baldwin at Montgomery,3186

### Selecting datapoints by conditions

In [61]:
# Selecting all rows where usertype is customer

bike_df.loc[bike_df['usertype'] == 'Customer']

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
1,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
3,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
35,367,2018-05-01 06:28:03,2018-05-01 06:34:10,3278,Monmouth and 6th,3186,Grove St PATH,26235,Single Ride,Customer
139,699,2018-05-01 07:45:27,2018-05-01 07:57:07,3268,Lafayette Park,3214,Essex Light Rail,33562,Single Ride,Customer
151,334,2018-05-01 07:52:39,2018-05-01 07:58:14,3201,Dey St,3195,Sip Ave,26178,24 Hour,Customer
...,...,...,...,...,...,...,...,...,...,...
32348,842,2018-05-30 12:15:18,2018-05-30 12:29:21,3194,McGinley Square,3195,Sip Ave,29463,3-Day Pass from Citi Bike App,Customer
32352,278,2018-05-30 12:21:07,2018-05-30 12:25:46,3214,Essex Light Rail,3214,Essex Light Rail,33680,24 Hour,Customer
32353,1004,2018-05-30 12:21:20,2018-05-30 12:38:04,3214,Essex Light Rail,3183,Exchange Place,29646,24 Hour,Customer
32358,557,2018-05-30 12:28:48,2018-05-30 12:38:06,3214,Essex Light Rail,3183,Exchange Place,26198,24 Hour,Customer
32391,4387,2018-05-30 13:12:04,2018-05-30 14:25:12,3213,Van Vorst Park,3213,Van Vorst Park,26272,Single Ride,Customer

In [62]:
# finding number of rows with 'end station id' as 3213

rows, columns = bike_df[bike_df['end station id']==3213].shape
print(rows,'rides has been ended at 3213 end station')

734 rides has been ended at 3213 end station

In [63]:
# find all data that has start station name as 'City Hall' and  usertype as 'Customer'

bike_df.loc[(bike_df['start station name']=='City Hall') & 
            (bike_df['usertype'] == 'Customer')]

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
3,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
406,845,2018-05-01 10:03:30,2018-05-01 10:17:35,3185,City Hall,3192,Liberty Light Rail,29622,3 Day,Customer
407,826,2018-05-01 10:03:54,2018-05-01 10:17:41,3185,City Hall,3192,Liberty Light Rail,33587,3 Day,Customer
549,21094,2018-05-01 13:45:21,2018-05-01 19:36:56,3185,City Hall,3185,City Hall,33641,24 Hour,Customer
1116,858,2018-05-01 20:52:13,2018-05-01 21:06:32,3185,City Hall,3203,Hamilton Park,29525,24 Hour,Customer
1597,1101,2018-05-02 09:00:33,2018-05-02 09:18:54,3185,City Hall,3199,Newport Pkwy,29592,Single Ride,Customer
1880,746,2018-05-02 15:27:03,2018-05-02 15:39:29,3185,City Hall,3192,Liberty Light Rail,29271,24 Hour,Customer
2108,2909,2018-05-02 18:07:58,2018-05-02 18:56:27,3185,City Hall,3196,Riverview Park,26310,24 Hour,Customer
2109,2925,2018-05-02 18:08:12,2018-05-02 18:56:58,3185,City Hall,3196,Riverview Park,33636,24 Hour,Customer
2111,2868,2018-05-02 18:08:38,2018-05-02 18:56:27,3185,City Hall,3196,Riverview Park,26294,24 Hour,Customer
2112,2833,2018-05-02 18:09:17,2018-05-02 18:56:31,3185,City Hall,3196,Riverview Park,26255,24 Hour,Customer
4432,1783,2018-05-04 16:31:05,2018-05-04 17:00:49,3185,City Hall,3202,Newport PATH,33638,24 Hour,Customer
4930,1626,2018-05-04 21:36:04,2018-05-04 22:03:11,3185,City Hall,3638,Washington St,32046,24 Hour,Customer
5577,1108,2018-05-05 14:18:43,2018-05-05 14:37:11,3185,City Hall,3639,Harborside,26193,Day Pass,Customer
6350,6646,2018-05-06 11:54:09,2018-05-06 13:44:55,3185,City Hall,3185,City Hall,33665,Single Ride,Customer
6352,6627,2018-05-06 11:54:29,2018-05-06 13:44:56,3185,City Hall,3185,City Hall,33568,Single Ride,Customer
6382,2514,2018-05-06 12:15:22,2018-05-06 12:57:16,3185,City Hall,3185,City Hall,33571,24 Hour,Customer
6383,2499,2018-05-06 12:15:37,2018-05-06 12:57:17,3185,City Hall,3185,City Hall,33612,24 Hour,Customer
6616,7216,2018-05-06 16:01:15,2018-05-06 18:01:32,3185,City Hall,3211,Newark Ave,26199,24 Hour,Customer
6845,2540,2018-05-06 19:45:07,2018-05-06 20:27:28,3185,City Hall,3268,Lafayette Park,29445,24 Hour,Customer
6847,2528,2018-05-06 19:45:22,2018-05-06 20:27:30,3185,City Hall,3268,Lafayette Park,26316,24 Hour,Customer
6848,2596,2018-05-06 19:45:42,2018-05-06 20:28:58,3185,City Hall,3268,Lafayette Park,33658,24 Hour,Customer
6851,2357,2018-05-06 19:48:10,2018-05-06 20:27:28,3185,City Hall,3268,Lafayette Park,33579,24 Hour,Customer
6853,2168,2018-05-06 19:51:13,2018-05-06 20:27:21,3185,City Hall,3268,Lafayette Park,29608,24 Hour,Customer
8191,285,2018-05-07 21:14:15,2018-05-07 21:19:01,3185,City Hall,3209,Brunswick St,26204,3 Day,Customer
8711,438,2018-05-08 09:31:30,2018-05-08 09:38:48,3185,City Hall,3202,Newport PATH,26294,Single Ride,Customer
12273,29237,2018-05-11 00:26:46,2018-05-11 08:34:04,3185,City Hall,3185,City Hall,26223,24 Hour,Customer
15253,6897,2018-05-14 15:47:59,2018-05-14 17:42:56,3185,City Hall,3185,City Hall,26223,24 Hour,Customer
15254,55010,2018-05-14 15:48:17,2018-05-15 07:05:07,3185,City Hall,3185,City Hall,26206,24 Hour,Customer
16560,11125,2018-05-15 13:59:06,2018-05-15 17:04:31,3185,City Hall,3205,JC Medical Center,29644,24 Hour,Customer
16561,11110,2018-05-15 13:59:28,2018-05-15 17:04:39,3185,City Hall,3205,JC Medical Center,29533,24 Hour,Customer
17716,461,2018-05-16 22:29:29,2018-05-16 22:37:11,3185,City Hall,3268,Lafayette Park,29676,3 Day,Customer
17718,480,2018-05-16 22:31:03,2018-05-16 22:39:03,3185,City Hall,3225,Baldwin at Montgomery,29268,3-Day Pass from Citi Bike App,Customer
19312,658,2018-05-18 15:02:12,2018-05-18 15:13:11,3185,City Hall,3199,Newport Pkwy,33609,3-Day Pass from Citi Bike App,Customer
20721,762,2018-05-20 14:43:49,2018-05-20 14:56:32,3185,City Hall,3185,City Hall,29604,24 Hour,Customer
20927,246,2018-05-20 17:08:38,2018-05-20 17:12:45,3185,City Hall,3185,City Hall,29538,24 Hour,Customer
21625,420,2018-05-21 09:22:44,2018-05-21 09:29:44,3185,City Hall,3183,Exchange Place,29569,24 Hour,Customer
23145,4427,2018-05-22 09:44:28,2018-05-22 10:58:15,3185,City Hall,3185,City Hall,29490,24 Hour,Customer
24287,1634,2018-05-23 12:20:28,2018-05-23 12:47:42,3185,City Hall,3183,Exchange Place,29265,24 Hour,Customer
24980,1554,2018-05-23 20:31:39,2018-05-23 20:57:34,3185,City Hall,3185,City Hall,29223,Day Pass,Customer
24981,1519,2018-05-23 20:31:44,2018-05-23 20:57:04,3185,City Hall,3185,City Hall,33558,Day Pass,Customer
27804,884,2018-05-25 19:24:10,2018-05-25 19:38:54,3185,City Hall,3202,Newport PATH,26184,24 Hour,Customer
28109,1182,2018-05-26 09:18:56,2018-05-26 09:38:38,3185,City Hall,3202,Newport PATH,29288,24 Hour,Customer
28439,511,2018-05-26 13:35:10,2018-05-26 13:43:41,3185,City Hall,3185,City Hall,26194,24 Hour,Customer
28576,6378,2018-05-26 15:35:53,2018-05-26 17:22:11,3185,City Hall,3185,City Hall,26164,24 Hour,Customer
28577,6345,2018-05-26 15:36:21,2018-05-26 17:22:07,3185,City Hall,3185,City Hall,26206,24 Hour,Customer
28696,3390,2018-05-26 17:38:28,2018-05-26 18:34:59,3185,City Hall,3199,Newport Pkwy,26303,Single Ride,Customer
28697,3383,2018-05-26 17:38:29,2018-05-26 18:34:53,3185,City Hall,3199,Newport Pkwy,26206,Single Ride,Customer
30073,177,2018-05-28 17:54:18,2018-05-28 17:57:16,3185,City Hall,3185,City Hall,26283,24 Hour,Customer
30076,427,2018-05-28 17:57:51,2018-05-28 18:04:59,3185,City Hall,3183,Exchange Place,33602,24 Hour,Customer
30077,408,2018-05-28 17:57:52,2018-05-28 18:04:40,3185,City Hall,3183,Exchange Place,26283,24 Hour,Customer
31583,5853,2018-05-29 20:14:57,2018-05-29 21:52:31,3185,City Hall,3186,Grove St PATH,29639,Single Ride,Customer
31589,5771,2018-05-29 20:16:26,2018-05-29 21:52:37,3185,City Hall,3186,Grove St PATH,26153,Single Ride,Customer
31708,143,2018-05-29 21:46:26,2018-05-29 21:48:49,3185,City Hall,3205,JC Medical Center,26250,Day Pass,Customer
31716,865,2018-05-29 22:02:02,2018-05-29 22:16:27,3185,City Hall,3206,Hilltop,29447,Single Ride,Customer

In [64]:
# selecting all data where usertype is not 'Subscriber'

bike_df.loc[~(bike_df['usertype']=='Subscriber')]

,tripduration,starttime,stoptime,start station id,start station name,end station id,end station name,bikeid,name_localizedValue,usertype
1,1482,2018-05-01 01:31:10,2018-05-01 01:55:53,3681,Grand St,3185,City Hall,33593,24 Hour,Customer
3,190,2018-05-01 02:03:29,2018-05-01 02:06:40,3185,City Hall,3186,Grove St PATH,29662,24 Hour,Customer
35,367,2018-05-01 06:28:03,2018-05-01 06:34:10,3278,Monmouth and 6th,3186,Grove St PATH,26235,Single Ride,Customer
139,699,2018-05-01 07:45:27,2018-05-01 07:57:07,3268,Lafayette Park,3214,Essex Light Rail,33562,Single Ride,Customer
151,334,2018-05-01 07:52:39,2018-05-01 07:58:14,3201,Dey St,3195,Sip Ave,26178,24 Hour,Customer
...,...,...,...,...,...,...,...,...,...,...
32348,842,2018-05-30 12:15:18,2018-05-30 12:29:21,3194,McGinley Square,3195,Sip Ave,29463,3-Day Pass from Citi Bike App,Customer
32352,278,2018-05-30 12:21:07,2018-05-30 12:25:46,3214,Essex Light Rail,3214,Essex Light Rail,33680,24 Hour,Customer
32353,1004,2018-05-30 12:21:20,2018-05-30 12:38:04,3214,Essex Light Rail,3183,Exchange Place,29646,24 Hour,Customer
32358,557,2018-05-30 12:28:48,2018-05-30 12:38:06,3214,Essex Light Rail,3183,Exchange Place,26198,24 Hour,Customer
32391,4387,2018-05-30 13:12:04,2018-05-30 14:25:12,3213,Van Vorst Park,3213,Van Vorst Park,26272,Single Ride,Customer

### Iterating over the dataframe

In [65]:
space_org = {'Organizations_name' : ["CNES", "ISRO", "NASA", "JAXA", "CNSA"],
                   'Headquarters' : ["Paris", "Bangalore", "Washington",
                                     "Tokyo", "Beijing"],
                   'Country_name' : ["France", "India", "USA", "Japan", "China"],
                 'Formation_year' : [1961, 1969, 1958, 2003, 1993]
             }

In [66]:
sorg_df = pd.DataFrame(space_org)
sorg_df

  Organizations_name Headquarters Country_name  Formation_year
0               CNES        Paris       France            1961
1               ISRO    Bangalore        India            1969
2               NASA   Washington          USA            1958
3               JAXA        Tokyo        Japan            2003
4               CNSA      Beijing        China            1993

In [67]:
# To view all the column names in the dataframe by loop

for i in sorg_df:
    print(i)

Organizations_name
Headquarters
Country_name
Formation_year

In [68]:
# To view all data row-wise

for row in sorg_df.iterrows():
    print(row,'\n')

(0, Organizations_name      CNES
Headquarters           Paris
Country_name          France
Formation_year          1961
Name: 0, dtype: object)

(1, Organizations_name         ISRO
Headquarters          Bangalore
Country_name              India
Formation_year             1969
Name: 1, dtype: object)

(2, Organizations_name          NASA
Headquarters          Washington
Country_name                 USA
Formation_year              1958
Name: 2, dtype: object)

(3, Organizations_name     JAXA
Headquarters          Tokyo
Country_name          Japan
Formation_year         2003
Name: 3, dtype: object)

(4, Organizations_name       CNSA
Headquarters          Beijing
Country_name            China
Formation_year           1993
Name: 4, dtype: object)

In [69]:
# To view all data row-wise with index at top

for index,row in sorg_df.iterrows():
    print(index)
    print(row,'\n')

0
Organizations_name      CNES
Headquarters           Paris
Country_name          France
Formation_year          1961
Name: 0, dtype: object

1
Organizations_name         ISRO
Headquarters          Bangalore
Country_name              India
Formation_year             1969
Name: 1, dtype: object

2
Organizations_name          NASA
Headquarters          Washington
Country_name                 USA
Formation_year              1958
Name: 2, dtype: object

3
Organizations_name     JAXA
Headquarters          Tokyo
Country_name          Japan
Formation_year         2003
Name: 3, dtype: object

4
Organizations_name       CNSA
Headquarters          Beijing
Country_name            China
Formation_year           1993
Name: 4, dtype: object

In [70]:
# accessing column wise

for column, values in sorg_df.iteritems():
    print('Column_name:',column)
    print(values,'\n')

Column_name: Organizations_name
0    CNES
1    ISRO
2    NASA
3    JAXA
4    CNSA
Name: Organizations_name, dtype: object

Column_name: Headquarters
0         Paris
1     Bangalore
2    Washington
3         Tokyo
4       Beijing
Name: Headquarters, dtype: object

Column_name: Country_name
0    France
1     India
2       USA
3     Japan
4     China
Name: Country_name, dtype: object

Column_name: Formation_year
0    1961
1    1969
2    1958
3    2003
4    1993
Name: Formation_year, dtype: int64

In [71]:
# accessing all rows as tuple

for tpl in sorg_df.itertuples():
    print(tpl)

Pandas(Index=0, Organizations_name='CNES', Headquarters='Paris', Country_name='France', Formation_year=1961)
Pandas(Index=1, Organizations_name='ISRO', Headquarters='Bangalore', Country_name='India', Formation_year=1969)
Pandas(Index=2, Organizations_name='NASA', Headquarters='Washington', Country_name='USA', Formation_year=1958)
Pandas(Index=3, Organizations_name='JAXA', Headquarters='Tokyo', Country_name='Japan', Formation_year=2003)
Pandas(Index=4, Organizations_name='CNSA', Headquarters='Beijing', Country_name='China', Formation_year=1993)